lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaDimmableLightJoinable/ZigbeeHaDimmableLightJoinable.ino
void applyDefaultReporting() {
  g_device.configureReporting(kZigbeeClusterOnOff, 0x0000U,
                              ZigbeeZclDataType::kBoolean, 0U, 30U, 0U);
  g_device.configureReporting(kZigbeeClusterLevelControl, 0x0000U,
                              ZigbeeZclDataType::kUint8, 0U, 30U, 16U);
}

void applyReportingState() {
  if (!g_haveRestoredState || g_restoredState.reportingCount == 0U) {
    applyDefaultReporting();
    return;
  }

  for (uint8_t i = 0U; i < g_restoredState.reportingCount && i < 8U; ++i) {
    if (!g_restoredState.reporting[i].used) {
      continue;
    }
    g_device.configureReporting(g_restoredState.reporting[i].clusterId,
                                g_restoredState.reporting[i].attributeId,
                                g_restoredState.reporting[i].dataType,
                                g_restoredState.reporting[i].minimumIntervalSeconds,
                                g_restoredState.reporting[i].maximumIntervalSeconds,
                                g_restoredState.reporting[i].reportableChange);
  }
}

void applyBindingState() {
  if (!g_haveRestoredState || g_restoredState.bindingCount == 0U) {
    return;
  }

  for (uint8_t i = 0U; i < g_restoredState.bindingCount && i < 8U; ++i) {
    if (!g_restoredState.bindings[i].used) {
      continue;
    }
    (void)g_device.addBinding(g_restoredState.bindings[i].sourceEndpoint,
                              g_restoredState.bindings[i].clusterId,
                              g_restoredState.bindings[i].destinationAddressMode,
                              g_restoredState.bindings[i].destinationGroup,
                              g_restoredState.bindings[i].destinationIeee,
                              g_restoredState.bindings[i].destinationEndpoint);
  }
}

void applyLedState() {
  uint16_t dutyPermille = 0U;
  if (g_device.onOff()) {
    const uint16_t level = g_device.level();
    dutyPermille =
        static_cast<uint16_t>((static_cast<uint32_t>(level) * 1000UL) / 0xFEUL);
    if (dutyPermille == 0U && level > 0U) {
      dutyPermille = 1U;
    }
  }

  if (g_pwmReady) {
    (void)g_pwm20.setDutyPermille(dutyPermille);
    return;
  }

  (void)Gpio::write(kPinUserLed, dutyPermille == 0U);
}

void clearActiveNetworkKey() {
  memset(g_activeNetworkKey, 0, sizeof(g_activeNetworkKey));
  g_activeNetworkKeySequence = 0U;
  g_haveActiveNetworkKey = false;
}

void configureDeviceForCurrentNetwork() {
  ZigbeeBasicClusterConfig basic{};
  basic.manufacturerName = "CleanCore";
  basic.modelIdentifier = "X54-JOIN-DIM";
  basic.swBuildId = "0.3.0";
  basic.powerSource = 0x01U;
  g_device.configureDimmableLight(kLocalEndpoint, kIeeeAddress, g_localShort,
                                  g_panId, basic, 0x0000U);
  applyReportingState();
  applyBindingState();
  (void)g_device.setLevel(g_savedLevelState);
  (void)g_device.setOnOff(g_savedOnOffState);
}

bool persistState() {
  refreshCommissioningState();
  ZigbeePersistentState state{};
  ZigbeeCommissioning::populatePersistentState(
      g_network, kIeeeAddress, ZigbeeLogicalType::kEndDevice,
      g_device.config().manufacturerCode, &state);
  state.onOffState = g_device.onOff();
  state.levelState = g_device.level();

  const ZigbeeReportingConfiguration* reporting = g_device.reportingConfigurations();
  uint8_t copied = 0U;
  for (uint8_t i = 0U; i < 8U && copied < 8U; ++i) {
    if (!reporting[i].used) {
      continue;
    }
    state.reporting[copied++] = reporting[i];
  }
  state.reportingCount = copied;
  const ZigbeeBindingEntry* bindings = g_device.bindings();
  copied = 0U;
  for (uint8_t i = 0U; i < 8U && copied < 8U; ++i) {
    if (!bindings[i].used) {
      continue;
    }
    state.bindings[copied++] = bindings[i];
  }
  state.bindingCount = copied;
  return g_store.save(state);
}

void restoreState() {
  memset(&g_restoredState, 0, sizeof(g_restoredState));
  g_haveRestoredState = false;
  g_savedOnOffState = false;
  g_savedLevelState = 0x80U;
  ZigbeeCommissioning::initializeEndDeviceState(&g_network,
                                                commissioningPolicy(),
                                                kPreferredChannel,
                                                kPreferredPanId, kLightShort,
                                                kCoordinatorShort);

  ZigbeePersistentState state{};
  if (g_store.load(&state) && state.ieeeAddress == kIeeeAddress) {
    g_restoredState = state;
    g_haveRestoredState = true;
    g_savedOnOffState = state.onOffState;
    g_savedLevelState = state.levelState;
    if (g_savedLevelState == 0U && state.onOffState) {
      g_savedLevelState = 0x80U;
    }
    ZigbeeCommissioning::restoreEndDeviceState(&g_network, state, kIeeeAddress);
  }

  configureDeviceForCurrentNetwork();
  applyLedState();
}

void clearJoinState(bool clearStore) {
  refreshCommissioningState();
  ZigbeeCommissioning::clearEndDeviceState(&g_network, clearStore);
  if (clearStore) {
    memset(&g_restoredState, 0, sizeof(g_restoredState));
    g_haveRestoredState = false;
    g_savedOnOffState = false;
    g_savedLevelState = 0x80U;
  }
  configureDeviceForCurrentNetwork();
  applyLedState();
  if (clearStore) {
    g_store.clear();
  } else {
    persistState();
  }
}

void requestSecureRejoin() {
  refreshCommissioningState();
  ZigbeeCommissioning::requestSecureRejoin(&g_network);
}

void clearPendingApsAck() {
  memset(&g_pendingApsAck, 0, sizeof(g_pendingApsAck));
}

void rememberPendingApsAck(const ZigbeeApsDataFrame& aps) {
  if (aps.deliveryMode != kZigbeeApsDeliveryUnicast || !aps.ackRequested) {
    clearPendingApsAck();
    return;
  }
  g_pendingApsAck.active = true;
  g_pendingApsAck.counter = aps.counter;
  g_pendingApsAck.clusterId = aps.clusterId;
  g_pendingApsAck.profileId = aps.profileId;
  g_pendingApsAck.destinationEndpoint = aps.destinationEndpoint;
  g_pendingApsAck.sourceEndpoint = aps.sourceEndpoint;
  g_pendingApsAck.deadlineMs = millis() + kApsAckTimeoutMs;
}

bool matchesPendingApsAck(const ZigbeeApsAcknowledgementFrame& ack) {
  return g_pendingApsAck.active && ack.valid && !ack.ackFormatCommand &&
         ack.counter == g_pendingApsAck.counter &&
         ack.clusterId == g_pendingApsAck.clusterId &&
         ack.profileId == g_pendingApsAck.profileId &&
         ack.destinationEndpoint == g_pendingApsAck.sourceEndpoint &&
         ack.sourceEndpoint == g_pendingApsAck.destinationEndpoint;
}

void maybeExpirePendingApsAck(uint32_t nowMs) {
  if (!g_pendingApsAck.active ||
      static_cast<int32_t>(nowMs - g_pendingApsAck.deadlineMs) < 0) {
    return;
  }
  Serial.print("aps_ack miss ctr=0x");
  Serial.print(g_pendingApsAck.counter, HEX);
  Serial.print(" cluster=0x");
  Serial.print(g_pendingApsAck.clusterId, HEX);
  Serial.print("\r\n");
  clearPendingApsAck();
}

bool sendApsAcknowledgement(uint16_t destinationShort,
                            const ZigbeeApsDataFrame& request) {
  if (!g_joined || request.deliveryMode != kZigbeeApsDeliveryUnicast ||
      !request.ackRequested) {
    return false;
  }
  const bool useSecurity = g_securityEnabled && g_haveActiveNetworkKey;

