lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaDimmableLightJoinable/ZigbeeHaDimmableLightJoinable.ino
  if (responseLength > 0U &&
      aps.deliveryMode == kZigbeeApsDeliveryUnicast) {
    (void)sendApsFrame(nwk.sourceShort, aps.sourceEndpoint, aps.clusterId,
                       aps.profileId, aps.destinationEndpoint, responseFrame,
                       responseLength);
  }
}

void pollCoordinator() {
  refreshCommissioningState();
  if (!ZigbeeCommissioning::shouldPollParent(g_network)) {
    return;
  }

  uint8_t request[127] = {0U};
  uint8_t requestLength = 0U;
  if (!ZigbeeCodec::buildDataRequest(g_macSequence++, g_panId, g_parentShort,
                                     kIeeeAddress, request, &requestLength)) {
    return;
  }
  if (!g_radio.transmit(request, requestLength, false, 1200000UL)) {
    return;
  }

  const uint32_t deadline = millis() + 80U;
  while (static_cast<int32_t>(millis() - deadline) < 0) {
    ZigbeeFrame frame{};
    if (!g_radio.receive(&frame, 4000U, 250000UL)) {
      continue;
    }
    processIncomingFrame(frame);
    return;
  }
}

void maybeSendScheduledReports(uint32_t nowMs) {
  if (!g_joined) {
    return;
  }

  const ZigbeeReportingConfiguration* reporting = g_device.reportingConfigurations();
  for (uint8_t i = 0U; i < 8U; ++i) {
    if (!reporting[i].used || reporting[i].maximumIntervalSeconds == 0U ||
        reporting[i].maximumIntervalSeconds == 0xFFFFU) {
      continue;
    }

    const uint32_t periodMs =
        static_cast<uint32_t>(reporting[i].maximumIntervalSeconds) * 1000UL;
    if ((nowMs - g_lastReportMs[i]) < periodMs) {
      continue;
    }

    if (sendAttributeReport(reporting[i].clusterId)) {
      g_lastReportMs[i] = nowMs;
    }
  }
}

void handleSerialCommands() {
  while (Serial.available() > 0) {
    const int ch = Serial.read();
    if (ch == 't') {
      g_savedOnOffState = !g_device.onOff();
      (void)g_device.setOnOff(g_savedOnOffState);
      g_savedLevelState = g_device.level();
      applyLedState();
      persistState();
      Serial.print("toggle onoff=");
      Serial.print(g_device.onOff() ? "ON" : "OFF");
      Serial.print(" level=");
      Serial.print(g_device.level());
      Serial.print("\r\n");
    } else if (ch == 'U' || ch == 'D' || ch == 'M') {
      uint16_t nextLevel = g_device.level();
      if (ch == 'U') {
        nextLevel = static_cast<uint16_t>(nextLevel) + 32U;
      } else if (ch == 'D') {
        nextLevel = (nextLevel > 32U) ? static_cast<uint16_t>(nextLevel - 32U) : 1U;
      } else {
        nextLevel = 128U;
      }
      if (nextLevel > 0xFEU) {
        nextLevel = 0xFEU;
      }
      (void)g_device.setLevel(static_cast<uint8_t>(nextLevel));
      g_savedOnOffState = g_device.onOff();
      g_savedLevelState = g_device.level();
      applyLedState();
      persistState();
      Serial.print("level=");
      Serial.print(g_device.level());
      Serial.print(" onoff=");
      Serial.print(g_device.onOff() ? "ON" : "OFF");
      Serial.print("\r\n");
    } else if (ch == 'r') {
      const bool onOffOk = sendAttributeReport(kZigbeeClusterOnOff);
      const bool levelOk = sendAttributeReport(kZigbeeClusterLevelControl);
      Serial.print("report onoff=");
      Serial.print(onOffOk ? "OK" : "FAIL");
      Serial.print(" level=");
      Serial.print(levelOk ? "OK" : "FAIL");
      Serial.print("\r\n");
    } else if (ch == 'j') {
      requestSecureRejoin();
      Serial.print(g_rejoinPending ? "secure_rejoin requested\r\n"
                                   : "rejoin requested\r\n");
    } else if (ch == 'c') {
      clearJoinState(true);
      Serial.print("state cleared\r\n");
    } else if (ch == 's') {
      Serial.print("state joined=");
      Serial.print(g_joined ? "yes" : "no");
      Serial.print(" mode=");
      Serial.print(ZigbeeCommissioning::stateName(g_network.state));
      Serial.print(" failure=");
      Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
      Serial.print(" join_attempts=");
      Serial.print(g_network.joinAttempts);
      Serial.print(" rejoin_attempts=");
      Serial.print(g_network.rejoinAttempts);
      Serial.print(" ch=");
      Serial.print(g_channel);
      Serial.print(" pan=0x");
      Serial.print(g_panId, HEX);
      Serial.print(" short=0x");
      Serial.print(g_localShort, HEX);
      Serial.print(" nwk_seq=");
      Serial.print(g_haveActiveNetworkKey ? g_activeNetworkKeySequence : 0U);
      Serial.print(" alt_seq=");
      Serial.print(g_haveAlternateNetworkKey ? g_alternateNetworkKeySequence
                                             : 0U);
      Serial.print(" onoff=");
      Serial.print(g_device.onOff() ? "ON" : "OFF");
      Serial.print(" level=");
      Serial.print(g_device.level());
      Serial.print("\r\n");
    }
  }
}

}  // namespace

void setup() {
  Serial.begin(115200);
  delay(300);

  g_pwmReady = g_pwm20.beginSingle(kPinUserLed, 1000UL, 0U, false) &&
               g_pwm20.start(0, 200000UL);
  if (!g_pwmReady) {
    (void)Gpio::configure(kPinUserLed, GpioDirection::kOutput,
                          GpioPull::kDisabled);
  }

  g_store.begin("zbjoindm");
  restoreState();

  const bool ok = g_radio.begin(g_channel, 8);
  Serial.print("\r\nZigbeeHaDimmableLightJoinable start\r\n");
  Serial.print("radio=");
  Serial.print(ok ? "OK" : "FAIL");
  Serial.print(" pwm=");
  Serial.print(g_pwmReady ? "OK" : "FAIL");
  Serial.print(" preferred_channel=");
  Serial.print(kPreferredChannel);
  Serial.print(" joined=");
  Serial.print(g_joined ? "yes" : "no");
  Serial.print("\r\n");
  Serial.print("serial commands: t=toggle U=brighter D=dimmer M=mid r=report s=status j=rejoin c=clear\r\n");

  if (g_joined) {
    g_radio.setChannel(g_channel);
    if (g_securityEnabled && g_haveActiveNetworkKey) {
      (void)sendDeviceAnnounce();
    }
  }
}

void loop() {
  handleSerialCommands();

  const uint32_t now = millis();
  if (!g_joined) {
    clearPendingApsAck();
    const ZigbeeCommissioningAction action =
        ZigbeeCommissioning::nextAction(&g_network, now);
    if (action == ZigbeeCommissioningAction::kPollParent &&
        (now - g_lastPollMs) >= 250U) {
      g_lastPollMs = now;
      pollCoordinator();
    } else if (action == ZigbeeCommissioningAction::kSecureRejoin) {
      Serial.print("secure_rejoin start\r\n");
      if (performSecureRejoin()) {
        Serial.print("secure_rejoin OK ch=");
      } else {
        Serial.print("secure_rejoin MISS failure=");
        Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
        Serial.print("\r\n");
        delay(1);
        return;
      }
      Serial.print(g_channel);
      Serial.print(" pan=0x");
      Serial.print(g_panId, HEX);
      Serial.print(" short=0x");
      Serial.print(g_localShort, HEX);
      Serial.print("\r\n");
    } else if (action == ZigbeeCommissioningAction::kJoin) {
      Serial.print("scan_join start\r\n");
      if (!performJoin()) {
        Serial.print("join MISS failure=");
        Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
        Serial.print("\r\n");
        delay(1);
        return;
      }
      Serial.print("join OK ch=");
      Serial.print(g_channel);
      Serial.print(" pan=0x");
      Serial.print(g_panId, HEX);
      Serial.print(" short=0x");
      Serial.print(g_localShort, HEX);
      Serial.print("\r\n");
    }
    delay(1);
    return;
  }

  if ((now - g_lastPollMs) >= 250U) {
    g_lastPollMs = now;
    pollCoordinator();
  }
  maybeExpirePendingApsAck(now);
  maybeSendScheduledReports(now);

  if ((now - g_lastStatusMs) >= 5000U) {
    g_lastStatusMs = now;
    Serial.print("alive ch=");
    Serial.print(g_channel);
    Serial.print(" pan=0x");
    Serial.print(g_panId, HEX);
    Serial.print(" short=0x");
    Serial.print(g_localShort, HEX);
    Serial.print(" nwk_seq=");
    Serial.print(g_haveActiveNetworkKey ? g_activeNetworkKeySequence : 0U);
    Serial.print(" onoff=");
    Serial.print(g_device.onOff() ? "ON" : "OFF");
    Serial.print(" level=");
    Serial.print(g_device.level());
    Serial.print("\r\n");
  }

  delay(1);
}
